ConfigFiles/DataProcessors/КонтрольОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КонтрольОбъектов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ConfigFiles/InformationRegisters/ОбъектыНаКонтроле.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыНаКонтроле</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУказанияРезультата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторическаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехническийПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СписокКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/ВариантыВеденияСпискаКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыВеденияСпискаКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДатаКонтроляНазначаетсяНаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонтроляНазначаетсяНаОбъектКонтроля</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/DataProcessors/КонтрольОбъектов/Forms/РешениеИРезультатыКонтроля/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	НастроитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзменитьОтветственногоПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуОкончанияПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДляЧегоРедактируемОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОк(Команда)
	
	Закрыть(СтруктураВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	Если ЗначениеЗаполнено(Параметры.ОбъектКонтроля)
		И ЗначениеЗаполнено(Параметры.СписокКонтроля) Тогда
		
		ОбъектыКонтроля = Новый Массив;
		ОбъектыКонтроля.Добавить(Параметры.ОбъектКонтроля);
		
		СписокКонтроля = Параметры.СписокКонтроля;
		ОбъектКонтроля = Параметры.ОбъектКонтроля;
		
		ДанныеПоследнейЗаписи = РегистрыСведений.ОбъектыНаКонтроле.ДанныеПоследнейЗаписиКонтроля(ОбъектКонтроля, СписокКонтроля);
		
		ПредыдущееРешение       = ДанныеПоследнейЗаписи.Решение;
		ОжидаемаяДатаВыполнения = ДанныеПоследнейЗаписи.ОжидаемаяДатаВыполнения;
		Ответственный           = ДанныеПоследнейЗаписи.Ответственный;
		Результат               = ДанныеПоследнейЗаписи.Результат;
		ДатаПоследнегоКонтроля  = ДанныеПоследнейЗаписи.ДатаКонтроля;
		КоличествоЗаписей       = 1;
		ЭтоСнятиеСКонтроля      = Параметры.ЭтоСнятиеСКонтроля;
		ЭтоВозвратНаКонтроль    = Не ЭтоСнятиеСКонтроля И ДанныеПоследнейЗаписи.ИсторическаяЗапись;
		
		ВариантВеденияСписка = 
		ОбъектыНаКонтролеКлиентСервер.ВариантВеденияСпискаКонтроля(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СписокКонтроля, "ВариантВеденияСписка"));
		
	Иначе
		
		ОбъектыКонтроля = ОбъектыНаКонтроле.ОбъектыКонтроляПоКлючамЗаписиРегистраОбъектыНаКонтроле(Параметры.ИзменяемыеСтрокиСписка);
		
		ПредыдущееРешение       = Параметры.Решение;
		ОжидаемаяДатаВыполнения = Параметры.ОжидаемаяДатаВыполнения;
		Ответственный           = Параметры.Ответственный;
		Результат               = Параметры.Результат;
		ДатаПоследнегоКонтроля  = Параметры.ДатаКонтроля;
		КоличествоЗаписей       = Параметры.ИзменяемыеСтрокиСписка.Количество();
		ЭтоСнятиеСКонтроля      = Параметры.ЭтоСнятиеСКонтроля;
		
		СпискиКонтроля = ОбъектыНаКонтроле.СпискиКонтроляПоОбъектамКонтроля(Параметры.ИзменяемыеСтрокиСписка);
		Если ОбъектыНаКонтроле.ЕстьСписокВМассивеВариантКонтроляПоДатеОбъекта(СпискиКонтроля) Тогда
			ВариантВеденияСписка = Перечисления.ВариантыВеденияСпискаКонтроля.ДатаКонтроляНазначаетсяНаОбъектКонтроля;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВариантВеденияСписка = Перечисления.ВариантыВеденияСпискаКонтроля.ДатаКонтроляНазначаетсяНаОбъектКонтроля Тогда
		СледующаяДатаКонтроля = НачалоДня(ТекущаяДатаСеанса() + 86400);
	КонецЕсли;
	
	Элементы.ДекорацияДляЧегоРедактируем.Заголовок = ОбъектыНаКонтроле.ТекстДекорацииИзменяемыеЗаписиКонтроля(ОбъектыКонтроля);
	
	Если ЭтоСнятиеСКонтроля Тогда
		Элементы.ГруппаРешение.Заголовок = СтрШаблон(НСтр("ru = 'Решение по снятию с контроля от %1'"), Формат(НачалоДня(ТекущаяДатаСеанса()), "ДЛФ=DD"));
		Заголовок = НСтр("ru = 'Снятие с контроля'");
		Элементы.ГруппаУсловноИзменяемыеРеквизиты.Видимость  = Ложь;
	Иначе
		Элементы.ГруппаРешение.Заголовок = СтрШаблон(НСтр("ru = 'Новое решение от %1'"), Формат(НачалоДня(ТекущаяДатаСеанса()), "ДЛФ=DD"));
		Если ЭтоВозвратНаКонтроль Тогда
			Заголовок = НСтр("ru = 'Возврат на контроль'");
		Иначе
			Заголовок = НСтр("ru = 'Результаты контроля'");
		КонецЕсли;
	КонецЕсли;
	
	Если КоличествоЗаписей = 1 Тогда
		
		ИзменитьОтветственного = Истина;
		ИзменитьДатуОкончания  = Истина;
		Элементы.ГруппаПредыдущееРешение.Заголовок = СтрШаблон(НСтр("ru = 'Решение от %1'"), Формат(ДатаПоследнегоКонтроля, "ДЛФ=DD"));
		Элементы.ГруппаРезультат.Заголовок         = СтрШаблон(НСтр("ru = 'Результат по решению от %1'"), Формат(ДатаПоследнегоКонтроля, "ДЛФ=DD"));
		
	Иначе
		
		Элементы.ГруппаПредыдущееРешение.Видимость = Ложь;
		Высота = Высота - 4;
		СброситьРазмерыИПоложениеОкна();
		Если КоличествоЗаписей > 1 Тогда
			Высота = Высота + КоличествоЗаписей - 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураВозврата()
	
	СтруктураВозврата = Новый Структура;
	
	Если ЭтоСнятиеСКонтроля 
		И ПустаяСтрока(Решение) Тогда
		
		СтруктураВозврата.Вставить("Решение",  НСтр("ru = 'Объект снят с контроля'"));
		
	ИначеЕсли КоличествоЗаписей = 1
		И ПустаяСтрока(Решение) Тогда
		СтруктураВозврата.Вставить("Решение", Элементы.Решение.ПодсказкаВвода);
	Иначе
		СтруктураВозврата.Вставить("Решение", Решение);
	КонецЕсли;
	
	СтруктураВозврата.Вставить("Результат",               Результат);
	СтруктураВозврата.Вставить("Ответственный",           Ответственный);
	СтруктураВозврата.Вставить("ОжидаемаяДатаВыполнения", ОжидаемаяДатаВыполнения);
	СтруктураВозврата.Вставить("ИзменитьОтветственного",  ИзменитьОтветственного);
	СтруктураВозврата.Вставить("ИзменитьДатуОкончания",   ИзменитьДатуОкончания);
	СтруктураВозврата.Вставить("ЭтоСнятиеСКонтроля",      ЭтоСнятиеСКонтроля);
	
	Если ВариантВеденияСписка 
		= ПредопределенноеЗначение("Перечисление.ВариантыВеденияСпискаКонтроля.ДатаКонтроляНазначаетсяНаОбъектКонтроля") Тогда 
		
		СтруктураВозврата.Вставить("СледующаяДатаКонтроля", СледующаяДатаКонтроля);
		
	Иначе
		
		СтруктураВозврата.Вставить("СледующаяДатаКонтроля", Дата(1, 1, 1));
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма)

	ЭлементыФормы = Форма.Элементы;
	
	Если Форма.КоличествоЗаписей > 1 Тогда 
		
		ЭлементыФормы.ИзменитьОтветственного.Видимость           = Истина;
		ЭлементыФормы.ИзменитьДатуОкончания.Видимость            = Истина;
		ЭлементыФормы.Ответственный.Доступность                  = Форма.ИзменитьОтветственного;
		ЭлементыФормы.ОжидаемаяДатаВыполнения.Доступность        = Форма.ИзменитьДатуОкончания;
		ЭлементыФормы.Ответственный.ПоложениеЗаголовка           = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементыФормы.ОжидаемаяДатаВыполнения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
	Иначе
		
		ЭлементыФормы.ИзменитьОтветственного.Видимость           = Ложь;
		ЭлементыФормы.ИзменитьДатуОкончания.Видимость            = Ложь;
		ЭлементыФормы.Ответственный.Доступность                  = Истина;
		ЭлементыФормы.ОжидаемаяДатаВыполнения.Доступность        = Истина;
		ЭлементыФормы.Ответственный.ПоложениеЗаголовка           = ПоложениеЗаголовкаЭлементаФормы.Лево;
		ЭлементыФормы.ОжидаемаяДатаВыполнения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		
		ЭлементыФормы.Решение.ПодсказкаВвода = Форма.ПредыдущееРешение;
		
	КонецЕсли;
	
	Если Форма.ЭтоСнятиеСКонтроля Тогда
		
		ЭлементыФормы.Решение.ПодсказкаВвода = НСтр("ru = 'Объект снят с контроля'");
		
	ИначеЕсли Форма.ЭтоВозвратНаКонтроль Тогда
		
		ЭлементыФормы.Решение.ПодсказкаВвода = НСтр("ru = 'Объект возвращен на контроль'");
		
	КонецЕсли;
	
	ЭлементыФормы.СледующаяДатаКонтроля.Видимость = 
		(Форма.ВариантВеденияСписка = ПредопределенноеЗначение("Перечисление.ВариантыВеденияСпискаКонтроля.ДатаКонтроляНазначаетсяНаОбъектКонтроля"))
		И Не Форма.ЭтоСнятиеСКонтроля;
	
КонецПроцедуры

&НаСервере
Процедура СброситьРазмерыИПоложениеОкна()
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ХранилищеСистемныхНастроек.Удалить("Обработка.КонтрольОбъектов.Форма.ИзменениеРезультат", "", ИмяПользователя);
	КонецЕсли;
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
